name: "LogisticRegressionNet"
input: "data"
input_dim: 1
input_dim: 3
input_dim: 32
input_dim: 32

# paste your 2 layer NN from 2layernn.prototxt architecture here. 
# Make appropriate changes depending on your naming convention.

layer {
  name: "prob"
  type: "Softmax"
  bottom: "fc2"
  top: "prob"
}


